Repository: KDE/kde1-kdemultimedia
Catalog: po/*/kmedia.po
Languages: ro

source: Playback position
ro: Pozi376ia de pleibec

source: Eject medium
ro: Scoate sidiul

source: Previous track
ro: Pista anterioar343

source: Backward
ro: 316napoi

source: Play/Pause
ro: C342nt343/Pauz343

source: Forward
ro: 316nainte

source: Next track
ro: Pista urm343toare

source: &Preferences
ro: Preferin376e

source: Exited
ro: Ie272it

source: Init
ro: Ini376ializat

source: Busy
ro: Ocupat

source: Playing
ro: C342nt

source: Paused
ro: 316n pauz343

source: Ready
ro: Opera376ional

source: Undefined
ro: Nedefinit
