Repository: KDE/kde1-kdemultimedia
Catalog: po/*/kmid.po
Languages: eo, fi, hu, ko, pl, pt, sk, tr

source: Previous Song
eo: Antaýa kanto
fi: Edellinen kappale
hu: Elõzõ dal
ko: 이전 곡
pl: Poprzedni utwór
pt: Cançã‡ƒo Anterior
sk: Predchádzajúca pieseò
tr: Önceki Þarký

source: Next Song
eo: Sekva kanto
fi: Seuraava kappale
hu: Következõ dal
ko: 다음 곡
pl: Nastêpny utwór
pt: Próxima Cançã‡ƒo
sk: Nasledujúca pieseò
tr: Sonraki Þarký

source: See &Text events
eo: Vidu &Teksteventojn
fi: N‰yt‰ &Tekstitapahtumat
hu: Szöveg-események
ko: 텍스트 이벤트 보기(&T)
pl: Pokazuj &komentarze
pt: Ver eventos de &Texto
sk: &Textové udalosti
tr: M&etin Durumunu Gör

source: See &Lyrics events
eo: Vidu &Lirikeventojn
fi: N‰yt‰ &sanatapahtumat
hu: Dalszöveg-események
ko: 가사 보기(&L)
pl: Pokazuj &tekst
pt: Ver eventos de &Letras
sk: Udalosti v slovách
tr: Söz Durumunu Gör

source: &Save Lyrics ...
eo: &Sekurigu tekston ...
hu: &Dalszöveg mentése ...
ko: 가사 저장(&S)...
pl: &Zapisz tekst...
pt: &Gravar Letras ...
sk: &Ulo¾i» slová...
tr: &Sözleri Kaydet ...

source: &Play
eo: &Ludu
fi: &Soita
hu: &Lejátszás
ko: 연주(&P)
pl: &Odtwarzaj
pt: &Tocar
sk: &Hra»
tr: &Çal

source: P&ause
eo: &Paýzo
fi: &Tauko
hu: Szü&net
ko: 잠시멈춤(&a)
pl: P&auza
pt: P&ausar
sk: P&auza
tr: &Beklet

source: &Stop
fi: P&ys‰yt‰
hu: &Megállítás
ko: 정지(&S)
pt: &Parar
tr: D&ur

source: P&revious Song
eo: &Antaýa kanto
fi: &Edellinen kappale
hu: &Elõzõ dal
ko: 이전 곡(&r)
pl: Pop&rzedni utwór
pt: Cançã‡ƒo Ante&rior
sk: P&redchádzajúca pesnièka
tr: &Önceki Þarký

source: &Next Song
eo: &Sekva kanto
fi: Se&uraava kappale
hu: &Következõ dal
ko: 다음 곡(&N)
pl: &Nastêpny utwór
pt: Próx&ima Cançã‡ƒo
sk: &Nasledujúca pesnièka
tr: &Sonraki Þarký

source: &Loop
eo: &Cikle
fi: S&ilmukoi
hu: &Végtelenített
ko: 반복(&L)
pl: &Powtarzaj
pt: &Ciclo
sk: Dooko&la
tr: D&öngü

source: &Organize ...
eo: &Organizu...
fi: &J‰rjest‰ ...
hu: &Szervezõ
ko: 앨범만들기(&O)...
pl: &Kolejno¶æ...
pt: &Organizar ...
sk: &Spravova» ...
tr: &Ayarla ...

source: In order mode
eo: Laývica
fi: J‰rjestyksess‰
hu: Eredeti sorrendben
ko: 명령모드
pl: W kolejno¶ci
pt: Modo ordenado
sk: Hra» v poradí
tr: Sýralý kip

source: Shuffle mode
eo: Miksita
fi: Sekoitettuna
hu: Véletlen sorrenben
ko: 셔플모드
pl: Losowo
pt: Modo baralhado
sk: Náhodné poradie
tr: Rasgele kip

source: AutoAdd to Collection
fi: Automaattisesti lis‰‰ kokoelmiin
hu: Automatikusan bevesz a válogatásba
ko: 앨범에 자동 추가
pl: Dodawaj do kolecji
pt: Auto Adicionar à€ Coleçã‡ƒo
sk: Automaticky pridáva»
tr: Kolleksiyona Otomatik Ekle

source: &General Midi file
eo: Øenerala Midi-dosiero
fi: &General Midi tiedosto
hu: &General Midi fájl
ko: 일반 미디 파일(&G)
pl: Pliki &General Midi
pt: Ficheiro &General Midi
sk: &V¹eobecný Midi súbor
tr: &Genel Midi Dosyasý

source: &MT-32 file
eo: &MT-32-dosiero
fi: &MT-32 tiedosto
hu: &MT-32 fájl
ko: MT-32 파일(&M)
pl: Pliki &MT-32
pt: Ficheiro &MT-32
sk: &MT-32 súbor
tr: &MT-32 Dosyasý

source: &Automatic Text chooser
eo: &Aýtomata tekstelektilo
fi: &Automaattinen tekstinvalitsin
hu: &Automataikus szöveg/dalszöveg választás
ko: 자동 텍스트 선택기(&A)
pl: &Automatyczny wybór tekstu
pt: &Escolha Automática de Texto
sk: &Automaticky vybera» text
tr: &Otomatik Metin Seçici

source: Show &Volume Bar
hu: &Hangerõszabályozó látszik

source: Show &Channel View
hu: MidiCsatorna ablak

source: Channel View &Options
hu: MidiCsatorna ablak beállításai

source: &Font Change ...
eo: Þanøu tiparon...
fi: &Kirjasimen vaihtaminen ...
hu: &Betûtípus változtatás
ko: 글꼴 변경(&F)...
pl: Zmieñ &czcionkê...
pt: Mudar &Fonte ...
sk: &Zmena písma ...
tr: &Yazýtipi Deðiþimi ...

source: Midi &Setup ...
hu: &Midi beállítások

source: &Song
eo: &Kanto
fi: &Kappale
hu: &Dalok
ko: 곡(&S)
pl: &Utwór
pt: &Cançã‡ƒo
sk: &Pieseò
tr: &Þarký

source: &Collections
eo: &Kolektoj
fi: K&okoelmat
hu: &Válogatások
ko: 앨범(&C)
pl: &Kolekcja
pt: &Colecções
sk: &Zbierky
tr: &Derlemeler

source: Rewind
eo: Malantaýen
fi: Takaisin
hu: Vissza
ko: 되감기
pl: Przewiñ
pt: Rebobinar
sk: Spä»
tr: Baþa al

source: Pause
eo: Paýzo
fi: Tauko
hu: Szünet
ko: 잠시멈춤
pl: Pauza
pt: Pausa
sk: Pauza
tr: Beklet

source: Play
eo: Ludu
fi: Soita
hu: Lejátszás
ko: 연주
pl: Odtwarzaj
pt: Tocar
sk: Hra»
tr: Çal

source: Forward
eo: Antaýen
fi: Eteen
hu: Elõre
ko: 앞으로
pl: W przód
pt: Avanç‡ar
sk: Vpred
tr: Ýleri

source: Show Channel View
hu: Csatornákat mutat

source: Show Volume Bar
hu: Hangerõszabályozót mutat

source: Couldn't open /dev/sequencer to get some info Probably there is another program using it
eo: Ne eblis malfermi /dev/sequencer por legi kelkajn informojn. Eble alia programo uzas la aparaton.
fi: En saanut avattua /dev/sequencer tiedon saamiseksi. Mahdollisesti joku muu ohjelma k‰ytt‰‰ sit‰
hu: A /dev/sequencer eszközt nem lehet megnyitni. Valószínûleg egy másik program használja...
ko: /dev/sequencer의 정보를 얻을 수 없읍니다 다른 프로그램이 사용중인 것 같습니다
pl: Nie mo¿na otworzyæ /dev/sequencer Prawdopodobnie u¿ywany jest przez inny program
pt: Nãƒo consegui abrir /dev/sequencer para obter informções Provavelmente está a ser utilizado por outro programa
sk: Nemô¾em otvori» /dev/sequencer aby som získal niektoré informácie. Mo¾no ho pou¾íva iný program.
tr: /dev/sequencer bilgi almak için açýlamýyor Baþka bir program kullanýyor olmalý

source: File %s already exists Do you want to overwrite it ?
eo: Dosiero %s jam ekzistas Æu vi volas anstataýigi øin?
fi: Tiedosto %s on jo olemassa Haluatko ylikirjoittaa sen ?
hu: %s nevû fájl már létezik. Felül akarod írni ?
ko: %s 파일이 이미 존재합니다 파일에 덮어 쓰시겠습니까?
pl: Plik %s ju¿ istnieje Czy chcesz go skasowaæ?
pt: Ficheiro %s já existe Quer sobrepo-lo ?
sk: Súbor %s u¾ existuje Chcete ho prepísa» ?
tr: %s dosyasý zaten mevcut Üzerine yazmak istiyor musunuz ?

source: Tempo :
hu: Tempó :
ko: 템포 :

source: The file %s doesn't exist or can't be opened
eo: La dosiero %s ne ekzistas aý ne estas malfermebla
fi: Tiedostoa %s ei ole olemassa tai sit‰ ei saada avattua
hu: A(z) %s fájl nem létzik, vagy nem nyitható meg
ko: %s 파일이 존재하지 않거나 열 수 없습니다
pl: Plik %s nie istnieje lub nie mo¿e byæ otworzony
pt: O ficheiro %s nãƒo existe ounãƒo pode ser aberto
sk: Súbor %s neexistuje alebo sa nedá otvori».
tr: %s dosyasý yok ya da açýlamýyor

source: The file %s is not a midi file
eo: La dosiero %s ne estas Midi-dosiero
fi: Tiedosto %s ei ole miditiedosto
hu: A(z) %s nevû fájl nem midi fájl
ko: %s 파일은 미디 파일이 아닙니다
pl: Plik %s nie jest plikiem midi
pt: %s não é‰ um ficheiro mid válido
sk: Súbor %s nie je midi súbor.
tr: %s dosyasý bir midi dosyasý deðil

source: Not enough memory !!
eo: Ne sufiæas la memoro!!
fi: Muistia ei ole tarpeeksi !!
hu: Ninncs elég memória !!
ko: 메모리가 부족합니다 !!
pl: Brak pamiêci!!
pt: Falta de memória !!
sk: Nedostatok pamäte !!
tr: Yetersiz bellek !!

source: This file is corrupted or not well built
eo: Tiu æi dosiero estas difektita aý ne bone formita
fi: T‰m‰ tiedosto on viallinen tai huonosti rakennettu
hu: Ez a fájl hibás!
ko: 파일이 손상되었거나 제대로 만들어지지 않았습니다
pl: Ten plik jest uszkodzony lub ¼le utworzony
pt: Este ficheiro está corrumpido ou mal construido
sk: Tento súbor je po¹kodený alebo zle urobený.
tr: Bu dosya oynanmýþ yada iyi yapýlmamýþ

source: Unknown error message
eo: Nekonata erarmesaøo
fi: Tuntematon virhe
hu: Ismeretlen hibaüzenet
ko: 알 수 없는 오류 메시지
pl: Komunikat nierozpoznanego b³êdu
pt: Mensagem de erro desconhecido
sk: Neznáma chyba
tr: Bilinmeyen hata mesajý

source: You must load a file before playing it
eo: Vi devas malfermi dosieron antaý ekludi
fi: Sinun on ladattava tiedosto ennen sen soittamista
hu: Elõbb be kell töltened egy dalt!
ko: 연주하기 전에 파일을 불러들여야 합니다
pl: Musisz otworzyæ plik przed jego odtworzeniem
pt: Deve carregar um ficheiro antes de o tocar
sk: Musíte naèíta» súbor pred hraním.
tr: Dosyayý çalmadan önce yüklemelisiniz

source: A song is already being played
eo: Jam kanto ludiøas
fi: Kappaletta soitetaan jo
hu: A lejátszás már folyamatban van
ko: 노래가 이미 연주중입니다
pl: Utwór aktualnie jest odtwarzany
pt: Uma cançã‡ƒoá está a ser tocada
sk: U¾ hrá pesnièka.
tr: Bir þarký zaten çalýnýyor

source: Couldn't open /dev/sequencer Probably there is another program using it
eo: Ne eblis malfermi /dev/sequencer Eble alia programo uzas øin
fi: En saanut avattua /dev/sequencer tiedon saamiseksi. Mahdollisesti joku muu ohjelma k‰ytt‰‰ sit‰
hu: A /dev/sequencer eszközt nem lehet megnyitni, lehet, hogy másik program használja...
ko: /dev/sequencer를 열 수 없읍니다 다른 프로그램이 사용중인 것 같습니다
pl: Nie mo¿na otworzyæ /dev/sequencer Prawdopodobnie u¿ywany jest przez inny program
pt: Nãƒo consegui abrir /dev/sequencer Provavelmente está a ser utilizado por outro programa
sk: Nemô¾em otvori» /dev/sequencer. Pravepodobne ho pou¾íva iný program.
tr: /dev/sequencer açýlamýyor Baþka bir program kullanýyor olmalý

source: Configure Midi devices
eo: Konfiguru Midi-aparatoj
fi: Aseta Midi laitteita
hu: Midi-eszközök beállítása
ko: 미디 장치 설정
pl: Konfiguracja urz±dzenia Midi
pt: Configurar dispositivos Midi
sk: Konfigurácia midi zariadení
tr: Midi aygýtlarýný ayarla

source: Select the midi device you want to use :
eo: Elektu la Midi-aparaton, kiun vi volas uzi:
fi: Valitse midilaite jota haluat k‰ytt‰‰ :
hu: Válaszd ki, melyik midi-eszközt akarod használni?
ko: 사용할 미디 장치를 선택하십시오 :
pl: Wybierz urz±dzenie midi:
pt: Seleccione o dispositivo midi que quer utilizar :
sk: Zvoµte midi zariadenie :
tr: Kullanmak istediðiniz Midi aygýtýný seçin :

source: None
eo: Neniu
fi: Ei mik‰‰n
hu: Egyik sem
ko: 없음
pl: Brak
pt: Nenhum
sk: ®iadnu
tr: Hiçbir þey

source: Collections Manager
eo: Kolektoadministrilo
fi: Kokoelmahallinta
hu: Válogatás-kezelõ
ko: 앨범 관리기
pl: Mened¿er kolekcji
pt: Gestor de Colecções
sk: Správca zbierok
tr: Derleme Düzenleyici

source: Available collections :
eo: Uzeblaj kolektoj:
fi: Olemassaolevat kokoelmat :
hu: Elérhetõ válogatások :
ko: 사용가능한 앨범 :
pl: Dostêpne kolekcje:
pt: Colecções disponíveis :
sk: Dostupné zbierky :
tr: Mevcut Derlemeler :

source: Songs in selected collection:
eo: Kantoj en la elektita kolekto:
fi: Kappaleet valitussa kokoelmassa:
hu: A választott válogatásbon levõ dalok:
ko: 선택된 앨범에 담긴 노래:
pl: Utwory w wybranej kolekcji:
pt: Canções na colecção seleccionada:
sk: Piesne vo zvolenej zbierke:
tr: Derlemeden seçilen þarkýlar:

source: New
eo: Nova
fi: Uusi
hu: Új
ko: 새 파일
pl: Nowa
pt: Nova
sk: Nová
tr: Yeni

source: Enter the name of the new collection
eo: Tajpu la nomon de la nova kolekto
fi: Anna uuden kokoelman nimi
hu: Add meg az új válogatás nevét:
ko: 새 앨범의 이름을 넣으십시오
pl: Wpisz nazwê nowej kolekcji
pt: Insira o nome da nova colecçã‡ƒo
sk: Zadajte názov novej zbierky
tr: Yeni derlemenin adýný giriniz

source: New Collection
eo: Nova kolekto
fi: Uusi kokoelma
hu: Új válogatás
ko: 새 앨범
pl: Nowa kolekcja
pt: Nova Colecçã‡ƒo
sk: Nová zbierka
tr: Yeni Derleme

source: The name '%s' is already used
eo: La nomo '%s' jam estas uzata
fi: Nimi %s on jo k‰ytˆss‰
hu: A %s név már használatban van.
ko: '%s'라는 이름이 이미 사용되었습니다.
pl: Nazwa '%s' jest ju¿ u¿yta
pt: O nome '%s' já está em uso
sk: Názov '%s' je u¾ pou¾itý.
tr: '%s' adý zaten kullanýmda

source: Enter the name of the copy collection
eo: Tajpu nomon por la kopio de la kolekto
fi: Anna kokoelman kopion nimi
hu: Add meg a másolat nevét:
ko: 앨범 복사본의 이름을 입력하십시오
pl: Wpisz nazwê kopi kolecji
pt: Insira o nome da colecção copiada
sk: Zadajte názov skopírovanej zbierky
tr: Kopya derlemesinin adýný giriniz

source: Copy Collection
eo: Kopiu kolekton
fi: Kopioi kokoelma
hu: Válogatás másolása
ko: 앨범 복사본
pl: Kopia kolekcji
pt: Copiar Colecção
sk: Kopírova» zbierku
tr: Kopya Derleme

source: Enter the new name for the selected collection
eo: Tajpu novan nomon por la elektita kolekto
fi: Anna uusi nimi kokoelmalle
hu: Add meg a kijelölt válogatás nevét!
ko: 선택된 앨범의 새 이름을 입력하십시오
pl: Wpisz now± nazwê wybranej kolekcji
pt: Insira o novo nome da colecção seleccionada
sk: Zadajte nový názov pre zvolenú zbierku
tr: Seçilmiþ derleme için yeni adý giriniz

source: Change Collection Name
eo: Þanøu kolketonomon
fi: Vaihda kokoelman nime‰
hu: Válogatás nevének megváltoztatása
ko: 앨범 이름 변경
pl: Zmieñ nazwê kolekcji
pt: Mudar Nome da Colecção
sk: Zmeni» názov zbierky
tr: Derleme adýný deðiþtir

source: Channel
hu: Csatorna

source: Configure Channel View
hu: Csatorna-nézet beállításai

source: 3D look
hu: 3D kinézet

source: 3D - filled
hu: 3D - kitöltött

source: Acoustic Grand Piano
hu: Akusztikus Koncertzongora

source: Bright Acoustic Piano
hu: Versenyzongora

source: Electric Grand Piano
hu: Elektromos Versenyzongora

source: Honky-Tonk
hu: Honky-Tonk Zongora

source: Rhodes Piano
hu: Rhodes Zongora

source: Chorused Piano
hu: Visszhangosított Zongora

source: Harpsichord
hu: Csemballó

source: Clavinet
hu: Klavinét

source: Celesta
hu: Cseleszta

source: Glockenspiel
hu: Harangjáték

source: Music Box
hu: Zenedoboz

source: Vibraphone
hu: Vibrafon

source: Xylophone
hu: Xilofon

source: Tubular Bells
hu: Csõharangok

source: Hammond Organ
hu: Hammond-orgona

source: Rock Organ
hu: Rock-orgona

source: Church Organ
hu: Templomi Orgona

source: Accordion
hu: Akkordion

source: Harmonica
hu: Harmonika

source: Tango Accordion
hu: Tangóharmonika

source: Acoustic Guitar (Nylon)
hu: Akusztikus Gitár (Nylon)

source: Acoustic Guitar (Steel)
hu: Akusztikus Gitár (Fém)

source: Electric Guitar (Jazz)
hu: Elektromos Gitár (Jazz)

source: Electric Guitar (Clean)
hu: Elektromos Gitár (Tiszta)

source: Electric Guitar (Muted)
hu: Elektromos Gitár (Fojtott)

source: Distortion Guitar
hu: Torzított Gitár

source: Guitar Harmonics
hu: Gitárakkordok

source: Acoustic Bass
hu: Nagybõgõ

source: Electric Bass (Finger)
hu: Basszusgitár (Ujj)

source: Electric Bass (Pick)
hu: Basszusgitár (Pengetõ)

source: Fretless Bass
hu: Basszusgitár (Bundok Nélkül)

source: Slap Bass 1
hu: Basszusgitár (Hüvelyk) 1

source: Slap Bass 2
hu: Basszusgitár (Hüvelyk) 2

source: Synth Bass 1
hu: Szintetizált Basszus 1

source: Synth Bass 2
hu: Szintetizált Basszus 2

source: Violin
hu: Hegedû

source: Viola
hu: Brácsa

source: Cello
hu: Cselló

source: Contrabass
hu: Nagybõgõ

source: Tremolo Strings
hu: Vonósok (Tremoló)

source: Orchestral Harp
hu: Hárfa

source: String Ensemble 1
hu: Vonószenekar 1

source: String Ensemble 2
hu: Vonószenekar 2

source: Synth Strings 1
hu: Szintetizált vonósok 1

source: Synth Strings 2
hu: Szintetizált Vonósok 2

source: Choir Aahs
hu: Kórus Aaaah

source: Voice Oohs
hu: Hang Ooooh

source: Synth Voice
hu: Szintetizált Emberi Hang

source: Orchestra Hit
hu: Nagyzenenekar

source: Trumpet
hu: Trombita

source: Muted Trumpet
hu: Fojtott Trombita

source: French Horn
hu: Franciakürt

source: Brass Section
hu: Fúvósszekció

source: Synth Brass 1
hu: Szintetizált Fúvósok 1

source: Synth Brass 2
hu: Szintetizált Fúvosok 2

source: Soprano Sax
hu: Szopránszaxofon

source: Alto Sax
hu: Altszaxofon

source: Tenor Sax
hu: Tenorszaxofon

source: Baritone Sax
hu: Baritonszaxofon

source: Oboe
hu: Oboa

source: English Horn
hu: Angolkürt

source: Clarinet
hu: Klarinét

source: Piccolo
hu: Pikkoló

source: Flute
hu: Fuvola

source: Recorder
hu: Furulya

source: Pan Flute
hu: Pánsíp

source: Blown Bottle
hu: Üveg

source: Whistle
hu: Fütty

source: Ocarina
hu: Okarina

source: Lead 1 - Square Wave
hu: Lead 1 - Nészögjel

source: Sitar
hu: Szitár

source: Banjo
hu: Bendzsó

source: Bagpipe
hu: Duda

source: Steel Drum
hu: Acéldob

source: Taiko Drum
hu: Taiko Dob

source: Melodic Tom
hu: Dallamdob

source: Synth Drum
hu: Dobszintetizátor

source: Breath Noise
hu: Lélegzet

source: Seashore
hu: Tengerzúgás

source: Bird Tweet
hu: Madárcsicsergés

source: Telephone
hu: Telefon

source: Helicopter
hu: Helikopter

source: Applause
hu: Taps

source: Gunshot
hu: Lövés

source: &Open ...
eo: &Malfermu...
ko: 열기(&O)...
pl: &Otwórz...
pt: &Abrir ...
sk: &Otvori» ...
tr: &Aç...

source: &Quit
eo: &Finu
fi: &Lopeta
ko: 종료(&Q)
pl: Za&koñcz
pt: &Sair
sk: &Koniec
tr: &Çýkýþ

source: &Midi Setup ...
eo: &Midi-konfigura¼o...
fi: &Midi asetukset ...
ko: 미디 설정(&M)...
pl: Ustawienia &Midi...
pt: Configuração do &Midi...
sk: &Nastavi» Midi..
tr: M&idi Ayarý ...

source: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Spain) Midi/Karaoke file player KMid comes with ABSOLUTELY NO WARRANTY; for details view file COPYING This is free software, and you are welcome to redistribute it under certain conditions
eo: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Spain) Midi/Karaoko-dosier-ludilo KMid venas SEN IU AJN GARANTIO; por detaloj rigardu la dosieron COPYING Tiu æi estas libera softvaro, kaj mi instigas vin redistribui øin sub certaj kondiæoj
fi: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Espanja) Midi/Karaoke soittaja KMid comes with ABSOLUTELY NO WARRANTY; for details view file COPYING This is free software, and you are welcome to redistribute it under certain conditions
ko: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Spain) 미디/가라오케 파일 연주기 KMid로 인한 피해는 책임지지 않습니다; 자세한 것은 COPYING을 참조하십시오 이 프로그램은 공개 소프트웨어입니다. 어떤 조건으로 자유롭게 재배포할 수 있습니다.
pl: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Spain) Odtwarzacz Midi/Karaoke KMid rozpowszechniany jest BEZ JAKIEJKOLWIEK GWARANCJI; w celu uzyskania bli¿szych informacji - patrz plik COPYING Niniejszy program jest oprogramowaniem wolnodostêpnym; mo¿esz go rozprowadzaæ na pewnych warunkach
pt: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Espanha) Reprodutor de ficheiros Midi/Karaoke KMid nãoo tem ABSOLUTAMENTE NENHUMA GARANTIA; para mais detalhes veja o ficheiro COPYING Este software é‰ livre, e pode redistribui-lo sobre certas conições
sk: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Spain) Prehrávaè súborov Midi/Karaoke KMid prichádza BEZ AKEJKO¥VEK ZÁRUKY. Pre bli¾ie podrobnosti si pozrite súbor COPYING. Toto je voµne ¹íriteµný softvér a privítame, keï ho budete ¹íri» za daných podmienok
tr: %s (C) 1997,98 Antonio Larrosa Jimenez (antlarr@arrakis.es) Malaga (Spain) Midi/Karaoke Dosya Çalýcýsý KMid garntisiz olarak daðýtýlmaktadýr. Detaylý bilgi için COPYING dosyasýna bakýnýz. Bu bir serbest programdýr, belirtilen koþullar altýnda programý daðýtabilirsiniz.

source: &File
eo: &Dosiero
fi: &Tiedosto
ko: 파일(&F)
pl: &Plik
pt: &Ficheiro
sk: &Súbor
tr: &Dosya

source: &Options
eo: &Opcioj
fi: &Asetukset
ko: 옵션(&O)
pl: &Opcje
pt: &Opções
sk: &Mo¾nosti
tr: &Seçenekler

source: &Help
eo: &Helpo
fi: &Ohje
ko: 도움말(&H)
pl: Pomo&c
pt: &Ajuda
sk: &Pomocník
tr: &Yardým

source: Stop
fi: Pys‰yt‰
ko: 정지
pt: Parar
tr: Durdur

source: Error
eo: Eraro
fi: Virhe
ko: 오류
pl: B³±d
pt: Erro
sk: Chyba
tr: Hata

source: Warning
eo: Averto
fi: Varoitus
ko: 경고
pl: Ostrze¿enie
pt: Aviso
sk: Varovanie
tr: Uyarý

source: OK
eo: Konfirmu
ko: 예
tr: PEKÝ

source: Cancel
eo: Rezignu
fi: Peruuta
ko: 취소
pl: Anuluj
pt: Cancelar
sk: Zru¹i»
tr: Vazgeç

source: Use the midi map :
fi: K‰yt‰ midi karttaa :
ko: 미디 맵 사용 :
pl: U¿yj mapy midi:
pt: Utilizar o mapa midi :
sk: Pou¾i» midi mapu :
tr: Midi haritasýný kullan :

source: Browse...
eo: Rigardu...
fi: Selaa...
ko: 찾아보기...
pl: Przegl±daj...
pt: Explorar...
sk: Listova»...
tr: Tara ...

source: Copy
eo: Kopiu
fi: Kopioi
ko: 복사
pl: Kopiuj
pt: Copiar
sk: Kopírova»
tr: Kopya

source: Delete
eo: Forigu
fi: Tuhoa
ko: 삭제
pl: Skasuj
pt: Apagar
sk: Zmaza»
tr: Sil

source: Add
eo: Aldonu
fi: Lis‰‰
ko: 추가
pl: Dodaj
pt: Adicionar
sk: Prida»
tr: Ekle

source: Remove
eo: Forigu
fi: Poista
ko: 제거
pl: Usuñ
pt: Apagar
sk: Odstráni»
tr: Sil

source: Ticks per cuarter note is negative, please, send this file to antlarr@arrakis.es
eo: Tikoj je kvaronnoto estas negativa, bonvolu sendi tiun dosieronal <antlarr@arrakis.es>
pl: Liczba taktów na æwiartkê jest ujemna. Proszê wys³aæ ten plik do antlarr@arrakis.es
pt: Ticks por cuarter note é‰ negativo, por favor envie este ficheiro para antlarr@arrakis.es
sk: Poèet taktov na ¹tvr»ovú notu je negatívny, prosím po¹lite tento súbor na adresu antlarr@arrakis.es.
tr: Nota baþýna vuruþ sayýsý negatif, lütfen bu dosyayýantlarr@arrakis.es adresine gönderiniz
