Repository: KDE/kde1-kdemultimedia
Catalog: po/*/kmidi.po
Languages: ca, da, no

source: Could not load folder.bmp
ca: No s'ha pogut carregar folder.bmp
da: Kunne ikke indlæse folder.bmp
no: Kunne ikke laste folder.bmp

source: Could not load cdup.bmp
ca: No s'ha pogut carregar cdup.bmp
da: Kunne ikke indlæse cdup.bmp
no: Kunne ikke laste cdup.bmp

source: Could not load file.bmp
ca: No s'ha pogut carregar file.bmp
da: Kunne ikke indlæse file.bmp
no: Kunne ikke laste file.bmp

source: Play/Pause
ca: Reproducció/Pausa
da: Spil/pause
no: Spill/pause

source: Loop Song
ca: Repeteix cançó
da: Lad sangen gå i løkke
no: La sangen gå i løkke

source: 15 Secs Forward
ca: 15 segons endavant
da: 15 sek fremad
no: 15 sek forover

source: 15 Secs Backward
ca: 15 segons endarrere
da: 15 sek baglæns
no: 15 sek bakover

source: Next Midi
ca: Midi següent
da: Næste midi
no: Neste midi

source: Previous Midi
ca: Midi anterior
da: Forrige midi
no: Forrige midi

source: Exit Kmidi
ca: Sortida
da: Afslut kmidi
no: Avslutt kmidi

source: Random Play
ca: Reproducció aleatòria
da: Spil tilfældigt
no: Spill tilfeldig

source: Configure Kmidi
ca: Configuració
da: Indstil kmidi
no: Konfigurer kmidi

source: Open Playlist
ca: Obre el repertori
da: Åbn spilleliste
no: Åpne spilleliste

source: Show Info Window
ca: Mostra la finestra d'informació
da: Vis informationsvindue
no: Vis informasjonsvindu

source: Volume Control
ca: Control de volum
da: Lydstyrkekontrol
no: Volumkontroll

source: Song --/--
ca: Cançó --/--
da: Sang --/--
no: Sang --/--

source: Replay
ca: Torna-la a tocar
da: Spil igen

source: Bwd
ca: Enr
da: Tlb

source: Fwd
ca: End
da: Frm

source: Prev
ca: Ant
da: Forrige

source: Next
ca: Seg
da: Næste

source: Playing
ca: En reproducció
da: Spiller
no: Spiller

source: Random
ca: Aleatori
da: Tilfældigt
no: Tilfeldig

source: Paused
ca: En pausa
da: Holder pause

source: Ready
ca: Preparat
da: Klar
no: Klar

source: Looping
ca: En repetició
da: I løkke
no: I løkke

source: kmidi Configuraton
ca: Configurador kmidi
da: kmidi-indstillinger
no: kmidi-konfigurasjon

source: KMidi %s Copyright (c) 1997-98 Bernd Johannes Wuebben wuebben@kde.org KMidi contains code from: TiMidity version 0.2.i Copyright (c) Tuukka Toivonen toivonen@clinet.fi
ca: KMidi %s Copyright (c) 1997-98 Bernd Johannes Wuebben wuebben@kde.org KMidi conté codi de: TiMidity versió 0.2.i Copyright (c) Tuukka Toivonen toivonen@clinet.fi
da: KMidi %s Copyright (c) 1997-98 Bernd Johannes Wuebben wuebben@kde.org KMidi indeholder kode fra: TiMidity version 0.2.i Copyright (c) Tuukka Toivonen toivonen@clinet.fi
no: KMidi %s Copyright (c) 1997-98 Bernd Johannes Wuebben wuebben@kde.org KMidi inneholder kode fra: TiMidity versjon 0.2.i Copyright (c) Tuukka Toivonen toivonen@clinet.fi

source: Configure
ca: Configura
da: Indstil
no: Konfigurer

source: Can't open Output Device.
ca: No es pot obrir el dispositiu de sortida
da: Kan ikke åbne output enhed
no: Kan ikke åpne utenhet

source: %s is not readable or doesn't exist.
ca: %s no es pot llegir o no existeix.
da: %s er ikke læsbar eller eksisterer ikke.
no: %s er ikke lesbar eller eksisterer ikke.

source: KMidi Warning
ca: Avís KMidi
da: KMidi-advarsel
no: KMidi-advarsel

source: Song: --/%02d
ca: Cançó: --/%02d
da: Sang --/%02d
no: Sang --/%02d

source: Linear
ca: Lineal
da: lineær
no: linjær

source: Stereo
ca: Estèreo

source: Song: %02d/%02d
ca: Cançó: %02d/%02d
da: Sang: %02d/%02d
no: Sang: %02d/%02d

source: Song: --/--
ca: Cançó: --/--
da: Sang --/--
no: Sang --/--

source: Compose Play List
ca: Composició del repertori
da: Sæt spilleliste sammen
no: Sett sammen spilleliste

source: Can not enter directory: %s
ca: No es pot entrar al directori: %s
da: kan ikke gå ind i folderen: %s
no: kan ikke gå inn i katalog: %s

source: Cannot open or read directory.
ca: No es pot obrir o llegir el directori.
da: Kan ikke åbne eller læse folderen.
no: Kan ikek åpne eller lese katalog.

source: LED Color:
ca: Color del LED:
da: LED-farve:
no: LED-farge:

source: Background Color:
ca: Color de fons:
da: Baggrundsfarve:
no: Bakgrunnsfarge:

source: Show Tool Tips
ca: Mostra indicacions
da: Vis værktøjstips
no: Vis verktøytips

source: Info Window
ca: Finestra d'informació
da: Informationsvindue
no: Informasjonsvindu

source: Dismiss
ca: Rebutja
da: Forkast
no: Forkast

source: ERROR
da: FEJL
no: FEIL
