Repository: KDE/kde1-kdemultimedia
Catalog: po/*/kmix.po
Languages: cs, de, fr, hr, is, pl, ro, sk, sv

source: &Hide Menubar
cs: &Skr375t menu
de: &Menü verstecken
fr: &Cacher la barre de menus
hr: &Sakrij izbornik
is: Fela &valmyndastiku
pl: U&kryj pasek menu
ro: &Ascunde bara de meniu
sk: &Skry273 menu
sv: &G366m menyf344lt

source: &Tickmarks On/Off
cs: S&tupnice zapnout/vypnout
de: &Skalen An/Aus
fr: &Graduations On/Off
hr: &Oznake uklj/isklj
is: &Kvar360i af/341
pl: &Podpowiedzi Tak/Nie
ro: &Marcaje on/off
sk: Zapn372273/vypn372273 z&na350kovanie
sv: &Bokm344rken P345/Av

source: &Options...
sk: &Nastavenie...

source: (C) 1997-1998 by Christian Esken (esken@kde.org). Sound mixer panel for the KDE Desktop Environment. This program is in the GPL. SGI Port done by Paul Kendall (paul@orion.co.nz). *BSD fixes by Sebestyen Zoltan (szoli@digo.inf.elte.hu) and Lennart Augustsson (augustss@cs.chalmers.se). ALSA port by Nick Lopez (kimo_sabe@usa.net).
cs: (C) 1997-1998 napsal Christian Esken (esken@kde.org). Zvukov375 mixa276n355 panel pro KDE. Tento program je pod GPL. SGI p370evod proveden Paulem Kendallem (paul@orion.co.nz). Opravy pro *BSD napsal Sebestyen Zoltan (szoli@digo.inf.elte.hu) a Lennart Augustsson (augustss@cs.chalmers.se). ALSA port napsal Nick Lopez (kimo_sabe@usa.net).
de: (C) Christian Esken (esken@kde.org) 1997-1998. Multikanal-Klangregler für das KDE Desktop Environment. Dieses Programm unterliegt der GPL. SGI-Port von Paul Kendall (paul@orion.co.nz). *BSD-Anpassungen von Sebestyen Zoltan (szoli@digo.inf.elte.hu) und Lennart Augustsson (augustss@cs.chalmers.se). ALSA port by Nick Lopez (kimo_sabe@usa.net).
fr: (C) 1997-1998 par Christian Esken (esken@kde.org). Table de mixage pour l'Environnement de Bureau KDE. Ce programme est sous GPL. Portage pour SGI r351alis351 par Paul Kendall (paul@orion.co.nz). *Corrections pour BSD par Sebestyen Zoltan (szoli@digo.inf.elte.hu) et Lennart Augustsson (augustss@cs.chalmers.se). Portage pour ALSA par Nick Lopez (kimo_sabe@usa.net).
hr: (C) 1997-1998 Christian Esken (esken@kde.org). Sound mixer ploèa za KDE Desktop Environment. Ovaj program pokriven je GPL licencom. SGI Port napravio Paul Kendall (paul@orion.co.nz). *BSD popravke napravio Sebestyen Zoltan (szoli@digo.inf.elte.hu) i Lennart Augustsson (augustss@cs.chalmers.se).ALSA port Nick Lopez (kimo_sabe@usa.net).
is: H366fundarr351ttur 1997-1998, Christian Esken (esken@kde.org). Hlj363360blandari fyrir KDE skj341umhverfi360. 336etta forrit fellur undir GPL. Paul Kendall (paul@orion.co.nz) f346r360i 341 SGI. Sebestyen Zoltan (szoli@digo.inf.elte.hu) laga360i BSD 372tg341funa 341samt Lennart Augustsson (augustss@cs.chalmers.se). Nick Lopez (kimo_sabe@usa.net) flutti 341 ALSA.
pl: (C) 1997-1998 by Christian Esken (esken@kde.org). Panel miksera dla 266rodowiska KDE. Ten program obj352ty jest licencj261 GPL. Port SGI Paul Kendall (paul@orion.co.nz). Poprawki *BSD Sebestyen Zoltan (szoli@digo.inf.elte.hu) i Lennart Augustsson (augustss@cs.chalmers.se).
ro: (C) 1997-1998 de Christian Esken (esken@kde.org). Mixer de sunet pentru KDE Desktop Environment. Acest program este înregistrat ca GPL. Modificare pt. SGI de Paul Kendall (paul@orion.co.nz). Corectare *BSD de Sebestyen Zoltan (szoli@digo.inf.elte.hu) ºi Lennart Augustsson (augustss@cs.chalmers.se).
sk: (C) 1997-1998 Christian Esken (esken@kde.org). Zvukov375 mixovac355 panel pre KDE Desktop Environment. Tento program m364276e by273 271355ren375 pod265a GPL. SGI Port spravil Paul Kendall (paul@orion.co.nz). *BSD opravy Sebestyen Zoltan (szoli@digo.inf.elte.hu) a Lennart Augustsson (augustss@cs.chalmers.se).ALSA port spravil Nick Lopez (kimo_sabe@usa.net).
sv: (C) 1997-1998 av Christian Esken (esken@kde.org). Ljud mixer panel f366r KDE Desktop Enviroment. Detta program 344r skrivet med GPL. SGI Port utf366rt av Paul Kendall (paul@orion.co.nz). *BSD fixar av Sebestyen Zoltan (szoli@digo.inf.elte.hu) och Lennart Augustsson (augustss@cs.chalmers.se).

source: &Left
cs: V&levo
de: &Links
fr: A &Gauche
hr: &Lijevo
is: &Vinstri
pl: &Lewy
ro: &Stânga
sk: &V265avo
sv: &V344nster

source: &Center
cs: Vy&centrovat
de: &Mitte
fr: Au &Centre
hr: &Centar
is: &Mi360ja
pl: 246&rodek
ro: &Centru
sk: Vy&centrova273

source: &Right
cs: Vp&ravo
de: &Rechts
fr: A &Droite
hr: &Desno
is: &H346gri
pl: &Prawy
ro: &Dreapta
sk: Vp&ravo
sv: &H366gre

source: &Show Menubar
cs: &Zobrazovat menu
de: Menü
fr: &Afficher la barre de menus
hr: Izbornik
is: Valmyndarstika
pl: Pasek menu
ro: Bara de meniu
sk: &Uk341za273 menu
sv: Menyf344lt

source: Un&mute
cs: Vypnout ztlu&men355
de: M&ute aus
fr: Non &muet
hr: Zvu&k
is: &Heyrast
pl: Z&g263o266
ro: &Activ
sk: Zapn372273 zv&uk
sv: Mute &av

source: &Mute
cs: Ztlu&mit
de: &Mute an
fr: &Muet
hr: &Ti¹ina
is: 336&agna
pl: Wy&cisz
ro: &Mut
sk: &Vypn372273 zvuk

source: &Split
cs: &Rozd354lit
de: &Trennen
fr: &S351parer
hr: Podje&li
is: &Klj372fa
pl: Ro&zdziel
ro: &Separare
sk: &Rozdeli273
sv: &Dela

source: Un&split
cs: &Sdru276it
de: &Verbinden
fr: &Attacher
hr: Spo&ji
is: &Sameina
pl: &Z263261cz
ro: &Unire
sk: &Zdru276i273
sv: &Sammanfoga

source: &RecSource
cs: Zd&roj nahr341v341n355
de: &Aufnahme-Quelle
fr: Source d'&enregistrement
hr: &Izvor snimka
is: Stilla &uppt366ku
pl: 254&r363d263o zapisu
ro: Sursã&Inreg
sk: Zd&roj nahr341vania
sv: Mottagar &k344lla

source: General
cs: Obecn351
de: Allgemeines
fr: G351n351ral
hr: Opæeniti
is: Almennt
pl: Og363lne
sk: V271eobecn351
sv: Generelt

source: Channels
cs: Kan341ly
de: Kanäle
fr: Canaux
hr: Kanali
is: R341sir
pl: Kana263y
ro: Canale
sk: Kan341ly
sv: Kanaler

source: Startup settings
cs: Nastaven355 p370i spu271t354n355
de: Starteinstellungen
fr: Param350tres de d351marrage
hr: Postavke pri startu
is: Upphafsgildi
pl: Ustawienia startowe
ro: Setãri iniþiale
sk: Nastavenie pri spusten355
sv: Uppstarts inst344llingar

source: Menubar
cs: Menu
de: Menü
fr: Barre de menus
hr: Izbornik
is: Valmyndarstika
pl: Pasek menu
ro: Bara de meniu
sk: Menu
sv: Menyf344lt

source: Tickmarks
cs: Stupnice
de: Skalen
fr: Graduations
hr: Oznake
is: Kvar360i
pl: Podpowiedzi
ro: Marcaje
sk: Zna350kovanie
sv: Bokm344rken

source: Allow docking
cs: Povolit dokov341n355
de: Andocken an Panel
fr: Autoriser l'insertion dans le panneau
hr: Dozvoli pristajanje (docking)
is: Hleypa 341 spjaldi360
pl: Pozw363l dokowa346
ro: Permite docare
sk: Povoli273 vs372vanie

source: KMix Preferences
cs: Nastaven355 Kmixu
de: KMix Einstellungen
fr: Pr351f351rences de KMix
hr: KMix Postava
is: KMix stillingar
pl: W263a266ciwo266ci KMix
ro: Preferinþe KMix
sk: Nastavenie Kmixu
sv: KMix Inst344llningar

source: Mixer channel setup
cs: Nastaven355 kan341l371 mixeru
de: Kanaleinstellungen
fr: Configuration des canaux du Mixeur
hr: Postavi mikser kanala
is: R341saval
pl: Ustawienia kana263363w miksera
ro: Setare canal mixer
sk: Nastavenie kan341lov mix351ru
sv: Mixer kanal inst344llningar (ej sparat 344nnu)

source: Device
cs: Za370355zen355
de: Gerät
fr: P351riph351rique
hr: Ureðaj
is: T346ki
pl: Urz261dzenie
ro: Dispozitiv
sk: Zariadenie
sv: Enhet

source: Show
cs: Zobrazovat
de: Zeige
fr: Afficher
hr: Prika¾i
is: S375na
pl: Poka277
ro: Aratã
sk: Zobrazova273
sv: Visa

source: Split
cs: Rozd354lit
de: Trennen
fr: S351parer
hr: Podijeli
is: Kj372fa
pl: Rozdziel
ro: Separare
sk: Rozdeli273
sv: &Dela

source: Minimize
cs: Minimalizovat
de: Minimieren
fr: Ic364nifier
hr: Smanji
is: L341gmarka
pl: Minimalizuj
ro: Minimizare
sk: Minimalizova273
sv: Minimera
