Repository: KDE/kde1-kdemultimedia
Catalog: po/*/kscd.po
Languages: cs, eo, ko, nl, sk, sv

source: CDDB Base Directory
cs: Výchozí adresáø CDDB:
eo: KDDB-Bazodosierujo
ko: CDDB 기본 디렉토리
sk: Hlavný prieèinok CDDB
sv: CDDB Baskatalog

source: Send CDDB submissions to:
cs: Pøíspìvky do CDDB posílat na:
eo: Sendu KDDB-erojn al:
ko: CDDB 요청 보낼 곳:
nl: Stuur CDDB entries naar:
sk: Posiela» CDDB po¾iadavky na:
sv: Sänd CDDB bidrag till:

source: Update
cs: Aktualizovat
eo: Aktualigu
ko: 갱신
nl: Vernieuwen
sk: Obnovi»
sv: Uppdatera

source: Enable Remote CDDB
cs: Pou¾ít vzdálenou CDDB
eo: Ebligu Foran KDDB
ko: 원격 CDDB 이용
nl: Remote CDDB aanzetten
sk: Povoli» vzdialené CDDB
sv: Använd CDDB

source: Defaults
cs: Implicitní
eo: Implicita¼oj
ko: 기본 설정
nl: Standaard isntellingen
sk: ©tandard.
sv: Standardvärden

source: Use HTTP proxy to access CDDB
cs: Pou¾ít proxy pro pøístup k CDDB
eo: Uzu HTTP-prokurilon por aliri KDDB
ko: CDDB 접속시 HTTP 프락시 사용
sk: Pou¾iva» HTTP proxy pre prístup k CDDB
sv: Använd HTTP-proxy för att komma åt CDDB

source: CD Database Editor
cs: Editor databáze CD
eo: KD-Datumbanka eraro
ko: CD 데이터베이스 편집기
sk: Databázový editor CD
sv: CD Databasredigerare

source: Total Time: %02d:%02d:%02d
cs: Celkový èas: %02d:%02d:%02d
eo: Tuta tempo: %02d:%02d:%02d
ko: 총 시간: %02d:%02d:%02d
nl: Totale tijd %02d:%02d:%02d
sk: Celk. èas: %02d:%02d:%02d
sv: Total tid: %02d:%02d:%02d

source: Total Time: %02d:%02d
cs: Celkový èas: %02d:%02d
eo: Tuta tempo: %02d:%02d
ko: 총 시간: %02d:%02d
nl: Totale tijd: %02d:%02d
sk: Celk. èas: %02d:%02d
sv: Total tid: %02d:%02d

source: Use this Editor to annotate this track
cs: Pou¾ijte editor pro poznámky k této písni/stopì
eo: Tie æi skribu komentojn pri la peco
ko: 트랙 주석 편집기
nl: Gebruik deze Editor om deze trak te noteren
sk: Pou¾ite tento editor na popísanie tejto stopy
sv: Använd denna redigerare för att kommentera detta spår

source: Use this Editor to annotate the title
cs: Pou¾ijte editor pro poznámky k tomuto titulu
eo: Tie æi skribu komentojn pri la titolo
ko: 제목 주석 편집기
nl: Gebruik deze Editor om te titel te noteren
sk: Pou¾ite tento editor na popísanie tohoto titulu
sv: Använd denna redigerare för att kommentera denna titel

source: Please select a Category or press Cancel
cs: Vyberte kategorii nebo stisknìte Zru¹it
eo: Bonvolu elekti kategorion aý premu 'Rezignu'
ko: 범위를 선택하거나 취소를 누르십시오
nl: Selecteer een categorie of druk op Cancel
sk: Prosím zvoµte kategóriu alebo stlaète Zru¹i»
sv: Vänligen välj kategori eller tryck på avbryt

source: To which category does the CD belong?
cs: Do které kategorie patøí toto CD?
eo: Al kiu kategorio apartenas la KD?
ko: CD가 어떤 분류항목에 포함되어 있습니까?
nl: Tot welke categorie behoort deze CD?
sk: Do akej kategórie patrí CD?
sv: Till vilken kategori tillhör denna CD?

source: Submitting cddb entry: %s
cs: Posílám polo¾ku CDDB: %s
eo: Sendante KDDB-eron: %s
ko: cddb 항목 요청하는 중: %s
sk: Zasielam cddb polo¾ku: %s
sv: Sänd CDDB-post: %s

source: Could not pipe contents into: %s
cs: Nepodaøilo se pøedat obsah do: %s
eo: Ne eblis dukti la enhavon al: %s
ko: 다음으로 내용을 보낼 수 없음: %s
sk: Nemô¾em zasla» obsah do: %s
sv: Kunde inte "pipe"(a) innehållet till: %s

source: Under which category would you like to store this CDDB entry?
cs: Do jaké katogorie chcete ulo¾it tuto polo¾ku CDDB?
eo: Sub kiu kategorio vi þatus sekurigi tiun KDDB-eron?
ko: 어느 분류항목에 이 CDDB 항목을 저장하시겠습니까?
nl: Onder welke categorie wil je deze CDDB entrie bewaren?
sk: Pod akou kategóriou si prajete ulo¾i» túto CDDB polo¾ku?
sv: Under vilken kategori vill du spara denna CDDB-post?

source: Unable to write to file: %s Please check your permissions and make your category directories exist.
cs: Není mo¾né zapisovat do souboru: %s Prosim, ovìøte pøístupová práva a ujistìte se, ¾e adresáøe pro kategorie existují.
eo: Ne eblis skribi dosieron: %s Bonvolu ekzameni viajn permesojn kaj cu la kategoridosierujo ekzistas.
ko: 다음 파일에 쓸 수 없음: %s 귀하의 권한을 확인하시고 분류항목 디렉토리를 만드십시오.
nl: Kan niet naar bestand schrijven: %s Controleer je permissies en zorg ervoor dat je categorie directories bestaan.
sk: Nemô¾em zapisova» do súboru: %s Prosím skontrolujte práva a vytvorte prieèinky s kategóriami.
sv: Kunde inte skriva till fil: %s Vänligen kontrollera dinna rättigheter och att din kategorikatalog existerar.

source: Kscd Error
cs: Chyba Kscd
eo: KScd-eraro
ko: Kscd 오류
nl: Kscd fout
sk: Chyba Kscd
sv: Kscd Fel

source: Invalid Database Entry
cs: Nesprávná polo¾ka databáze
eo: Nevalida datumbanka ero
ko: 잘못된 데이터베이스 항목
nl: Ongeldige databse entry
sk: Chybná databázová polo¾ka
sv: Ogiltig databaspost

source: The Disc Artist / Title field is not filled in. Please correct the entry and try again.
cs: Není vyplnìn interpret/titul.Prosím, doplòte tyto informace.
eo: La artisto/titolo ne estas indikita. Bonvolu korekti la eron kaj reprovu.
ko: 디스크의 아티스트 / 제목 항목이 비어 있습니다 항목을 수정하고 다시 시도하십시오.
nl: Het Disc Artist / Titel veld is niet goed ingevuld. Verbeter de entry en probeer opnieuw.
sk: Polo¾ka "Autor / Titul" nie je vyplnená. Prosím doplnte ju a skúste e¹te raz.
sv: CD artist-/ titelfält är inte ifyllt. Vänligen korrigera detta och försök igen.

source: The Disc Artist / Title field is not filled in correctly. Please separate the artist from the title of the CD with a forward slash, such as in: Peter Gabriel / Greatest Hits
cs: Interpret/Titul není správnì vyplnìn. Prosím, oddìlte interpreta of titulu pomocí lomítka, napø. Peter Gabriel / Greatest Hits
eo: La artisto/titolo ne estas øuste indikita. Bonvolu dividi ambaý per '/' kiel en 'Peter Gabriel /Greatest Hits
ko: 디스크의 아티스트 / 제목 항목이 바르게 채워지지 않았습니다 아티스트 항목을 CD 제목과 슬래쉬로 구분해 주십시오 예 : Peter Gabriel / Greatest Hits
nl: The Disc Artist / Title field is not filled in correctly. Zorg ervoor dat de artiest en de titel van de CD met een forward slash gescheiden zijn, bv.: Peter Gabriel / Greatest Hits
sk: Polo¾ka "Autor / Titul" nie je správne vyplnená. Prosím oddeµte autora od titulu s lomítkom, napríklad takto: Peter Gabriel / Greatest Hits
sv: CD Artist-/ titlefält är inte ifyllt korrekt. Vänligen separera artisten från CD's titel med ett snedsträck, så som i: Peter Gabriel / Greatest Hits

source: Not all track titles can be empty. Please correct the entry and try again.
cs: Musí být vyplòen alespoò jeden název písnì. Opravte, prosím názvy.
eo: Ne æiuj titoloj povas esti malplenaj. Bonvolu korekti la eron kaj reprovu.
ko: 모든 트랙 제목을 비울 수 없습니다. 항목을 수정하고 다시 시도하십시오.
nl: Niet alle nummer titels kunnen leeg zijn. Vebeter de entry's en probeer opniew.
sk: Nemô¾u by» v¹etky popisy stôp prázdne. Prosím opravte to a skúste znova.
sv: Alla spårtitlar kan inte vara toma. Vänligen korrigera detta och försök igen.

source: Internal Error
cs: Interní chyba
eo: Interna eraro
ko: 내부 오류
nl: Interne fout
sk: Interná chyba
sv: Internt fel

source: cdinfo.ntracks != title_list->count() + 1 Please email the author.
cs: cdinfo.ntracks != title_list->count() + 1 Po¹lete, prosím, e-mail s touto chybou autorovi programu.
eo: cdinfo.ntracks != title_list->count() + 1 Bonvolu mesaøi al la aýtoro.
ko: cdinfo.ntracks != title_list->count() + 1 제작자에게 전자우편을 보내십시오.
nl: cdinfo.ntracks != title_list->count() +1 Stuur email naar de autheur.
sk: cdinfo.ntracks != title_list->count() + 1 Prosím oboznámte autora.
sv: cdinfo.ntracks != title_list->count() + 1 Vänligen kontakta upphovsmannen av detta program.

source: Invalid Playlist
cs: Nesprávné poøadí písní.
eo: Nevalida Pecolisto
ko: 유효하지 않은 연주목록
nl: Ongeldige afspeellijst
sk: Chybný playlist
sv: Ogiltig spellista

source: Load
cs: Naèíst
eo: Malfermu
ko: 불러오기
nl: Laden
sk: Stiahnu»
sv: Ladda

source: Play List Editor
cs: Editor poøadí písní
eo: Pecolisto-redaktilo
ko: 연주 목록 편집기
nl: Afspeellijst Editor
sk: Editor playlistu
sv: Redigerare för spellista

source: Edit Track Title
cs: Uprav název písnì
eo: Redaktu la titolon
ko: 트랙 제목 편집
nl: Wijzig Track Titel
sk: Zmente titulok stopy
sv: Redigera spårtitel

source: Disc Artist / Title
cs: Interpret / Titul
eo: Artisto/Titolo de la disko
ko: 아티스트 / 제목
nl: Disc Artiest / Titel
sk: Autor disku / Titul
sv: CD Artit / titel

source: Track / Time / Title
cs: Stopa / Èas / Titul
eo: Peco / Tempo / Titolo
ko: 트랙 / 시간 / 제목
nl: Track / Tijd / Titel
sk: Stopa / Èas / Titul
sv: Spår / tid / titel

source: Ext Info
cs: Podrobnìji
eo: Notoj
ko: 추가 정보
nl: Ext Informatie
sk: Ext. popis
sv: Extern info

source: Disc ID
cs: ID disku
eo: Diskonumero
ko: 디스크 ID
sk: ID disku
sv: CD-id

source: Upload
cs: Poslat
eo: Alþutu
ko: 업로드
sk: Prenies»
sv: Överför

source: Configure kscd
cs: Nastav kscd
eo: Konfiguru Kscd
ko: kscd 설정
nl: Kscd instellen
sk: Nastavenie kscd
sv: Konfigurera kscd

source: LED Color:
cs: Barva LED:
eo: Lumetkoloro:
ko: LED 색:
nl: LED kleur:
sk: Farba textu:
sv: LED-färg:

source: Background Color:
cs: Barva pozadí:
eo: Fonkoloro:
ko: 배경 색:
nl: Achtergrond kleur:
sk: Farba pozadia:
sv: Bakgrunds färger:

source: CDROM Device:
cs: Zaøízení CD-ROM:
eo: KD-aparato:
ko: CDROM 장치:
sk: CDROM súbor:
sv: CDROM-enhet:

source: Unix mail command:
cs: Pøíkaz pro mail:
eo: Uniksa retpoþtkomando:
ko: Unix 전자우편 명령:
nl: Unix mail commando:
sk: Mail príkaz UNIXu:
sv: Unix postkommando:

source: WWW-Browser
cs: WWW prohlí¾eè
eo: TTT-legilo
ko: WWW-브라우저
nl: WWW-Bladeraar
sk: WWW-klient
sv: WWW-bläddrare

source: Use kfm as Browser
cs: Pou¾ij kfm jako prohlí¾eè
eo: Uzu Kfm kiel legilo
ko: 브라우저로 kfm 사용
nl: Gebruik kfm als browser
sk: Pou¾i» kfm
sv: Använd kfm som bläddrare

source: Use Custom Browser:
cs: Vlastní prohlí¾eè:
eo: Uzu propran legilon:
ko: 사용자 지정 브라우저:
nl: Gebruik eigen browser:
sk: Pou¾i» vlastný:
sv: Använd egen bläddrare:

source: Show Tool Tips
cs: Zobrazovat tipy
eo: Montru helpindikojn
ko: 도구 팁 보이기
nl: Tool tips tonen
sk: Ukazova» pomôcky
sv: Visa verktydstips

source: Enable KPanel Docking
cs: Povolit vsazení do KPanelu
eo: Enþaltu gastigon en la panelo
ko: KPanel에 작은 아이콘 표시
nl: KPanel Docking aanzetten
sk: Povoli» vsunutie do panelu
sv: Aktivera KPanel-dockning

source: Play on Tray Close
cs: Hrát pøi uzavøení
sk: Hra» pri zavretí dvierok

source: AutoDock on Minimize
cs: Automaticky dokovat pøi minimalizaci
sk: Do panelu pri ikoniz.

source: Stop Playing on Exit
cs: Pøestat hrát pøi ukonèení
sk: Presta» hra» pri ukonè.

source: Play/Pause
cs: Start/Pauza
eo: Ludu/Paýzo
ko: 연주/잠시멈춤
nl: Spelen / Pause
sk: Hra»/Pozastavi»
sv: Spela/Paus

source: Forward
cs: Dopøedu
sk: Vpred

source: Backward
cs: Zpìt
eo: Malantaýen
ko: 뒤로
nl: Terugspoelen
sk: Spä»
sv: Bakåt

source: Next
cs: Dal¹í
eo: Sekva
ko: 다음
nl: Volgende
sk: Vpred
sv: Nästa

source: Previous
cs: Pøedchozí
eo: Antaýa
ko: 이전
nl: Vorige
sk: Predchádzajúca
sv: Föregående

source: Eject
cs: Vysuò
eo: Eligu
ko: 꺼내기
sk: Vysunú»
sv: Mata ut

source: Minimize
cs: Minimalizuj
eo: Minimumigu
ko: 최소화
nl: Minimaliseren
sk: Minimalizova»
sv: Minimera

source: No exact match could be found. Please select the appropriate CD from the list of choices presented below.
cs: Nepodaøilo se najít odpovídající data. Prosím, vyberte pøíslu¹né CDz tohoto seznamu mo¾ností.
eo: Neniu ekzakta kongruo troviøis. Bonvolu elekti la øustan KDon el la malsupra listo.
ko: 정확히 일치하는 것이 없읍니다. 아래 선택 목록 중에서 적당한 CD를 선택 하시기 바랍니다.
nl: Geen exacte overeenstemming kon worden gevonden. Selecteer de gewenste CD uit de keuzelijst hieronder.
sk: Nemô¾em nájs» presnú zhodu. Prosím zvoµte príslu¹né CD zo zoznamu volieb, ktorý nájdete ni¾¹ie.
sv: Inget exakt matchande val kunde hittas. Vänligen välj lämplig CD från listan av CD-val presenterad nedan.

source: Please select a Disk Title or press Cancel
cs: Vyberte, prosím, titul nebo stisknìte Zru¹it
eo: Bonvolu elekti diskotitolon aý premu 'Rezignu'
ko: 디스크의 제목을 선택하거나 취소를 누르십시오
nl: Selecteer een Disc Titel of druk op Annuleren
sk: Prosím zvoµte titulok disku alebo stlaète Zru¹i»
sv: Vänligen välj en CD-titel eller tryck på avbryt

source: Record submitted successfully
cs: Záznam úspì¹nì odeslán
sk: Záznam úspe¹ne zaslaný

source: Error connecting to server.
cs: Chyba pøi pøipojování k serveru.
sk: Chyba pri pripájaní sa k serveru.

source: Not connected.
cs: Není spojeno.
sk: Nepripojený.

source: Connection timed out.
cs: Spojení vypr¹elo.
sk: Spojenie vypr¹alo.

source: Time out waiting for server interaction.
cs: Timeout pøi èekání na interakci se serverem.
sk: Èas pri èakaní na interakciu servera vypr¹al.

source: Server said: "%s"
cs: Server øekl: "%s"
sk: Server povedal: "%s"

source: Error #%d sending message via SMTP. %s
cs: Chyba #%d pøi odesílání zprávy pøe SMTP. %s
sk: Chyba #%d pri posielaní cez SMTP. %s

source: Vol: --
cs: Hlas: --
ko: 음량: --
sk: Hla: --

source: Performances
cs: Vystoupení
eo: Prezentoj
sk: Predstavenia
sv: Uppträdanden

source: Purchases
cs: Nákupy
eo: Aæetebloj
sk: Nakúpi»
sv: Köp

source: Loop CD
cs: Opakovat CD
eo: Ripetado
ko: CD 반복
nl: CD Herhaald afspelen
sk: Hra» CD dookola
sv: Cirkulera CD

source: Track Selection
cs: Výbìr stopy
eo: Pecoelekto
ko: 트랙 선택
sk: Voµba stopy
sv: Spårval

source: 30 Secs Forward
cs: o 30s dopøedu
eo: 30s antaýen
ko: 30초 앞으로
nl: 30 seconden voorwaarts
sk: 30 sek. vpred
sv: 30 sek framåt

source: 30 Secs Backward
cs: o 30s zpìt
eo: 30s malantaýen
ko: 30초 뒤로
nl: 30 seconden terug
sk: 30 sek. vzad
sv: 30 sek bakåt

source: Next Track
cs: Dal¹í stopa
eo: Sekva peco
ko: 다음 트랙
nl: Volgende track
sk: Nasl. stopa
sv: Nästa spår

source: Previous Track
cs: Pøedchozí stopa
eo: Antaýa peco
ko: 이전 트랙
nl: Vorige track
sk: Predch. stopa
sv: Föregående spår

source: Cycle Time Display
cs: Pøepínaè módu displeje
eo: Þanøu tempindikon
ko: 연주 시간 표시
sk: Strieda» druh zobrazenia èasu
sv: Ändra tidsvisning

source: Configure Kscd
cs: Nastav Kscd
eo: Konfiguru Kscd-on
ko: Kscd 설정
nl: Kscd instellen
sk: Nastavi» Kscd
sv: Konfigurera kscd

source: Eject CD
cs: Vysuò CD
eo: Eligu KDon
ko: CD 꺼내기
sk: Vysunú» CD
sv: Mata ut CD

source: The Artist on the Web
cs: Interpret na Webu
eo: La artisto en la reto
sk: Autori na Webe
sv: Artister på webben

source: Random Play
cs: Náhodné poøadí
eo: Hazarda ludo
ko: 임의 연주
nl: Willekeurige volgorde
sk: Náhodné prehrávanie
sv: Slumpmässig uppspelning

source: CDDB Dialog
cs: Dialogové okno CDDB
eo: KDDB-dialogo
ko: CDDB 대화창
nl: CDDB Dialoog
sk: CDDB okno

source: CD Volume Control
cs: Nastavení hlasitosti CD
eo: KD-stiro
ko: CD 음량 조절
sk: Kontrola hlasitosti CD
sv: CD Volymkontroll

source: Playing
cs: Hraji
eo: Ludante
ko: 연주중
nl: Bezig met spelen
sk: Hrám
sv: Spelar

source: %02d: <Unknown>
cs: %02d: (neznámý)
sk: %02d: <Neznámy>

source: Pause
cs: Pauza
eo: Paýzo
ko: 잠시 멈춤
sk: Pauza
sv: Paus

source: Random
cs: Náhodnì
eo: Hazardo
ko: 임의 연주
nl: Willekeurig
sk: Náhod.
sv: Slumpmässig

source: Strange....
cs: Divné....
nl: Vreemd....
sk: Stra¹né...
sv: Konstigt...

source: Stopped
cs: Zastaven
eo: Haltigita
ko: 멈춤
nl: Gestopt
sk: Zastavené
sv: Stanade

source: Loop
cs: Dokola
eo: Ripetado
ko: 반복
sk: Dookola
sv: Cirkulera

source: Ejecting
cs: Vysouvám
eo: Eligante
ko: 꺼냄
sk: Vysúvam
sv: Mata ut

source: kscd Configuraton
cs: Nastavení kscd
eo: Kscd-konfiguro
ko: Kscd 설정사항
nl: kscd Instellingen
sk: Nastavenie kscd
sv: kscd Konfiguration

source: KSCD Magic based on Synaesthesia by Paul Harrison <pfh@yoyo.cc.monash.edu.au>
cs: KSCD Magic je zalo¾en na Synaesthesia od Paula Harrisona <pfh@yoyo.cc.monash.edu.au>
eo: Kscd-soræo bazita su Synaesthesia de Paul Harrison <pfh@yoyo.cc.monash.edu.au>
ko: KSCD Magic은 Paul Harrison의 Synaesthesia에 기반을두고 있읍니다. <pfh@yoyo.cc.monash.edu.au>
nl: KSCD Magic gebaseerd op Synaesthesia door Paul Harrison <pfh@yoyo.cc.monash.edu.au>
sk: KSCD Magic zalo¾ený na Synaesthesia od Paula Harrisona <pfh@yoyo.cc.monash.edu.au>
sv: KSCD Magic baserad på Synaesthesia av Paul Harrison <pfh@yoyo.cc.monash.edu.au>

source: Thanks to Vadim Zaliva <lord@crocodile.org> for his work on the http proxy code.
cs: Dìkuji Vadimu Zalivovi <lord@crocodile.org> za práci na kódu pro http proxy.
sk: Poïakovabue pre Vadima Zalivu <lord@crocodile.org> za jeho prácu na http proxy kóde.

source: SMTP Setup
cs: Nastavení SMTP
sk: Nastavenie SMTP

source: Kscd Options
cs: Volby Kscd
eo: Kscd-opcioj
ko: Kscd 옵션
nl: Kscd Opties
sk: Mo¾nosti Kscd
sv: Kscd Val

source: Vol: %02d%%
cs: Hlas: %02d%%
ko: 음량: %02d%%
sk: Hla: %02d%%

source: CDROM read or access error. Please make sure you have access permissions to: %s
cs: Chyba pøi pøístupu nebo ètení CDROM. Ovìøte, prosím, svá pøístupová práva k: %s
eo: Eraro dum legado aý aliro de la KD. Bonvolu certigi, ke vi havas permeson por: %s
ko: CDROM 읽기 또는 억세스 오류 다음에 대한 억세스 허가권이 있는지 확인하십시오: %s
nl: CDROM lees of toegangs fout. Zorg ervoor dat de toegangsrechten hebt tot: %s
sk: Chyba pri èítaní alebo prístupe na CDROM. Prosím, uistite sa, ¾e máte práva na: %s
sv: CDROM läs- eller rättighetsfel. Vänligen kontrollera att du har rättigheter till: %s

source: Ready
cs: Pøipraven
eo: Preta
ko: 준비
nl: Klaar
sk: Pripr.
sv: Klar

source: Ejected
cs: Otevøen
eo: Eligite
ko: 열림
sk: Vysunuté
sv: Matade ut

source: Unable to get CDDB server list.
cs: Nepovedlo se získat data z CDDB serveru.
eo: Ne eblis ricevi liston de KDDB-serviloj.
ko: CDDB 서버 목록을 얻을 수 없음
nl: Kan de CDDB server lijst niet krijgen.
sk: Nemô¾em získa» zoznam CDDB serverov.
sv: Kan inte erhålla CDDB serverlista.

source: No matching CDDB entry found.
cs: ®ádná odpovídající polo¾ka CDDB.
eo: Ne troviøis kongrua KDDB-ero.
ko: 맞는 CDDB 항목을 찾을 수 없습니다
nl: Geen overeenkomende CDDB entry gevonden
sk: Nemô¾em nájs» CDDB polo¾ku.
sv: Ingen matchande CDDB-post hittades.

source: Error getting CDDB entry.
cs: Chyba pøi získávání CDDB polo¾ky.
sk: Chyba pri získavaní CDDB polo¾ky.

source: CDDB query timed out.
cs: CDDB timeout.
eo: KDDB-seræo atingis tempolimon.
ko: CDDB 질의 시간 초과
nl: CDDB zoekopdracht timed out.
sk: CDDB otázke vypr¹al èas.
sv: CDDB

source: Tra Rem
cs: Sto Zbyt
sk: Sto Zos
sv: Spå kv

source: Tot Sec
sk: CD Sek
sv: Tot sek

source: Tot Rem
cs: Tot Zbyt
sk: CD Zos
sv: Tot kv

source: Tra Sec
cs: Sto Sec
sk: Sto Sek
sv: Spå sek

source: Cannot start kscdmagic.
cs: Nepovedlo se spustit kscdmagic.
eo: Ne eblis lanæi kscdmagic
ko: kscdmagic을 실행할 수 없음
nl: Kan kscdmagic niet starten.
sk: Nemô¾em spusti» kscdmagic.
sv: Kan inte starta kscdmagic.

source: KSCD Magic exited abnormally. Are you sure kscdmagic is installed?
cs: KSCD Magic ukonèen s chybou. Máte KSCD Magic nainstalován?
eo: KSCD Magic nenormale finiøis. Æu vi estas certa, ke vi øuste instalis kscdmagic?
ko: KSCD Magic이 비정상적으로 종료됐읍니다. 분명히 kscdmagic을 설치했읍니까?
nl: KSCD Magic is abnormaal geeindigd. Weet je zeker dat kscdmagic is geinstalleerd?
sk: KSCD Magic skonèil s chybou. Ste si istý, ¾e ho máte správne nain¹talovaný?
sv: KSCD Magic avslutades onormalt. Är du säker på att kscdmagic är installerad?

source: Enter the local CDDB base Directory
sk: Zadajte hlavný lokálny prieèinok CDDB

source: -h: display commandline options
cs: -h: výpis voleb pøíkazové øádky
eo: -h: montru komandliniajn opciojn
ko: -h: 명령행 옵션을 보여줌
nl: -h: toon commandorgel opties
sk: -h: vypí¹ parametre príkazovej riadky
sv: -h: visar kommandoprompts val

source: -d: enable debugging output.
cs: -d: povolit výpis debug informací.
eo: -d: enþaltu malcimigajn mesaøojn.
ko: -d: 디버깅 출력을 가능하게 함
nl: -d: debugging output aanzetten.
sk: -d: povoµ ladiaci výstup (anglicky).
sv: -d: möjliggör debuggning av utdata.

source: Width of Magic Window:
cs: ©íøka magického okna:
eo: Laøeco de Soræfenestro:
ko: 매직 윈도우 넓이:
nl: Breedte van Magic Venster:
sk: ©írka Magic okna:
sv: Bredd hos Magic-fönster

source: Height of Magic Window:
cs: Vý¹ka magického okna:
eo: Alteco de Soræfenestro:
ko: 매직 윈도우 높이:
nl: Hoogte van Magic Venster:
sk: Vý¹ka Magic okna:
sv: Höjd hos Magic-fönster

source: MAGIC Brightness:
cs: Magický jas:
eo: Soræoheleco:
ko: Magic 밝기:
nl: MAGIC Helderheid:
sk: Svetlos» Magic:
sv: Magic ljusstyrka:

source: Enable submission via SMTP
cs: Umo¾nit odesílání pomoví SMTP
sk: Povoli» posielanie cez SMTP

source: SMTP Address:Port
cs: SMTP Adresa:Port
sk: SMTP adresa:port

source: Your Email Address
cs: Va¹e e-malová adresa
sk: Va¹a email adresa

source: CDDB server:
eo: KDDB-servilo:
ko: CDDB 서버:

source: KSCD Magic
eo: Kscd-soræo

source: Kscd Magic
eo: KScd-soræo

source: Magic Kscd
eo: Soræo Kscd
ko: 매직 Kscd
