<HTML>
<TITLE>Ayuda de KMid - Uso General</TITLE>
<BODY>
<P><H5>KMid 1.0  .  Antonio Larrosa Jimenez (antlarr@arrakis.es)  . 22-6-98 . Malaga (Espa&ntilde;a)</H5></P>
<HR>
<P><A NAME="2."></A><H2>2. Uso General</H2></P>
<P>
Esta secci&oacute;n describe el uso de las funciones mas importantes de KMid
</P>

<P><A NAME="2.1."></A><H3>2.1. Abriendo canciones</H3></P>
<P>
Hay muchas formas de abrir una canci&oacute;n. Puedes seleccionar 'Abrir...' del
 menu 'Archivo', entonces aparecer&aacute; un dialogo estandard de abrir ficheros,
 con el que podras seleccionar la cancion que desees abrir .
<BR>Puedes arrastrar un fichero desde una ventana de KFM y soltarlo en la ventana
 de KMid (usando el llamado Drag & Drop ).
 Tambi&eacute;n puedes arrastarar varios ficheros a la vez .
<BR>Si cuando ejecutes KMid, especificas un fichero en la linea de comandos,
 este ser&aacute; abierto .
<BR>Y la ultima forma es seleccionando una canci&oacute;n de la lista de canciones
 de la colecci&oacute;n activa .
</P>
<P><A NAME="2.2."></A><H3>2.2. Reproduciendo canciones</H3></P>
<P>
Para tocar una canci&oacute;n, primero debes abrirla, y entonces pulsar en el
 boton de 'Reproducir' de la Barra de Herramientas, o la entrada 'Tocar' del menu 'Canci&oacute;n',
 o simplemente pulsar la barra espaciadora .
 Notese que cuando se abre un fichero usando Drag & Drop, KMid empezar&aacute; a
 tocarlo inmediatamente (si se abre mas de un fichero, ser&aacute;n a&ntilde;adidos
 a una coleccion y tocados secuencialmente) .
<BR>Una vez que KMid est&aacute; tocando una canci&oacute;n, puedes mover
 la barra del tiempo, pulsando con el segundo bot&oacute;n del rat&oacute;n (el de en medio)
 para tocar desde un segundo determinado .
<BR>La barra espaciadora se usa para dos cosas, cuando la musica est&aacute;
 sonando y pulsas el 'espacio', funcionara como si hubieras pulsado en el bot&oacute;n
 de 'Pausa' o la entrada 'Pausa' del men&uacute; 'Canci&oacute;n', o sea,
 pausar&aacute; la m&uacute;sica . Si pulsas la barra espaciadora cuando no
 suena nada, se empezar&aacute; a tocar la canci&oacute;n que est&eacute; abierta .
</P>

<P><A NAME="2.3."></A><H3>2.3. Viendo la letra</H3></P>
<P>
Hay dos m&eacute;todos para guardar la letra en un fichero midi, usando "eventos de Texto"
 o "eventos de L&iacute;rica", algunas canciones usan el primero, otras, el segundo, algunas
 usan ambos m&eacute;todos , y otras no incluyen letra :-) . KMid te permite
 elegir que eventos mostrar. O incluso mejor, tiene una opci&oacute;n que 
 automagicamente selecciona el tipo de eventos que la canci&oacute;n usa, de
 forma que no tienes que elegirlo manualmente . De esta forma, si activas
 la entrada 'Elegir automaticamente evento' del men&uacute; 'Opciones', el
 texto del karaoke sera seleccionado automaticamente, pero todav&iacute;a podras
 cambiarlo por si prefieres ver el otro tipo .
<BR>Para seleccionar que tipo de eventos ver, puedes usar las correspondientes
entradas del men&uacute; 'Opciones', o s&oacute;lo pulsar las teclas '1' y
'2' de tu teclado paraver los 'Eventos de Texto' o de 'Eventos de L&iacute;rica' .
</P>
<HR>
<P ALIGN="RIGHT">
<A HREF="index1.html">Anterior</A>
    <A HREF="index.html">Tabla de Contenidos</A>
    <A HREF="index3.html">Siguiente</A>
</P>
</BODY></HTML>
