<HTML>
<TITLE>Ayuda de KMid - El Mapeador Midi</TITLE>
<BODY>
<P><H5>KMid 1.2  .  Antonio Larrosa Jimenez (antlarr@arrakis.es)  . 14-9-98 . Malaga (Espa&ntilde;a)</H5></P>
<HR>
<P><A NAME="4."></A><H2>4. El Mapeador Midi</H2></P>
<P><A NAME="4.1."></A><H3>4.1. Qu&eacute; es un mapa midi ?</H3></P>
<P>
Un Mapeador Midi es una herramienta que transforma unos eventos midi en otros.
<BR>Esto es muy util (de hecho, totalmente necesario) para los &oacute;rganos que
 no comprendan los eventos est&aacute;andares (o sea, si un teclado no es compatible General Midi)
 , en este caso, el mapeador midi traducir&aacute; los eventos General Midi en eventos
 que ese &oacute;rgano comprenda.
<BR>Por ejemplo, puedes hacer un mapeador midi que convierta todos los eventos del tipo
'Usar el instrumento piano', por 'Usar el instrumento trompeta', y asi cuando una canci&oacute;n
 intente tocar un piano, tocar&aacute; una trompeta en su lugar.
<BR>Esto puede resultar extra&ntilde;o, (¿Por qu&eacute; tocar una trompeta cuando la canci&oacute;n intenta tocar
 un piano ?), pero es muy util. El estandar GM especifica que cuando un
 teclado midi recibe un evento para cambiar al instrumento 0, cambiar&aacute; el instrumento
 actual a un 'Grand Piano', pero un sintetizador antiguo cambiar&aacute; a una
 'Guitarra El&eacute;ctrica' (por ejemplo) cuando reciba un 0. Este teclado antiguo,
 necesita recibir un 3 (por ejemplo) para cambiar a un Piano. Y aqu&iacute; se pone
 el mapeador midi en acci&oacute;n, cambiando todos los eventos de 'Cambiar instrumento al 0'
 por 'Cambiar instrumento al 3' y asi realmente tocar el instrumento correcto.
</P>

<P><A NAME="4.2."></A><H3>4.2. Necesito un mapa midi ?</H3></P>
<P>
Brevemente, si no tienes un &oacute;rgano externo, NO.
<BR>Si s&oacute;lo tienes una tarjeta de sonido, no necesitas mapeador midi pues
todas las tarjetas de sonido son compatibles GM (incluyendo a las AWE, GUS, etc.).
<BR>Si est&aacute;s tocando musica a trav&eacute;s de un &oacute;rgano externo que no
sea compatible GM, entonces necesitas hacer un mapeador midi para tu teclado midi.
 Aunque est&eacute;s toda una tarde haciendo un fichero de confihuraci&oacute;n
 e probando diferentes valores para todas las opciones, ser&aacute;s recompensado
 cuando lo termines, porque s&oacute;lo entonces encontraras todas las caracteristicas
 que tu teclado ten&iacute;a escondidas. Por ejemplo, yo tengo un Yamaha PSS-790,
 que no es compatible GM, y no tiene tantos instrumentos como un sintetizador GM,
 pero con el mapeador midi del KMid, suena incluso mejor que muchas tarjetas de sonido
 (incluyendo a una AWE :-)), debido a la calidad de los sonidos que tiene un
 sintetizados externo (incluso en los antiguos que no son GM)
</P>

<P><A NAME="4.3."></A><H3>4.3. Creando un mapa midi</H3></P>
<P>
No hay ning&uacute;n programa (todav&iacute;a) para generar mapas midi con lo que
tendr&aacute;s que editar el fichero a mano . Un hecho que quisiera hacer notar es que
mapa es una traducci&oacute;n mala de "map", pero en el fondo, tiene
sentido y adem&aacute;s se parece a la expresi&oacute;n inglesa "midi map" con lo que usar&eacute;
mapa midi para referirme al fichero de configuraci&oacute;n del mapeador midi.
<BR>Un mapa midi es un archivo en el que se guardan todas las conversiones necesarias que
se har&aacute;n cuando se toque la m&uacute;sica.
<BR>Consiste en varias secciones: PATCHMAP, KEYMAP, CHANNELMAP, OPTIONS
<BR>Cada secci&oacute;n debe aparecer s&oacute;lo una vez, excepto la secci&oacute;n KEYMAP que
 puede aparecer tantas veces como sea necesario, siempre que en cada aparici&oacute;n
 use un identificador distinto (continua leyendo para mas detalles)
<BR>La estructura general de un fichero map es :
<BR>-----------
<BU>
<BR>DEFINE PATCHMAP
<BR> ...
<BR>END
<BR>
<BR>DEFINE KEYMAP "Name of Keymap"
<BR> ...
<BR>END
<BR>DEFINE KEYMAP "Another name of Keymap"
<BR> ...
<BR>END
<BR>DEFINE CHANNELMAP
<BR> ...
<BR>END
<BR>OPTIONS
<BR> ...
<BR>END
</BU>
<BR>----------
<BR>Puedes ver que la palabra DEFINE se usa para especificar que secci&oacute;n
 se va a empezar (excepto en OPTIONS), y que END se pone al final de cada secci&oacute;n.
<BR>Puedes poner comentarios comenzando la linea con un caracter '#' .
<BR>Por favor, no olvides mandarme tu fichero de configuraci&oacute;n de tu mapeador midi
para que as&iacute; las versiones futuras de KMid incluyan soporte para mas teclados
que no sean General Midi.
</P>

<P><A NAME="4.3.1."></A><H3>4.3.1. La secci&oacute;n PATCHMAP</H3></P>
<P>
Esta secci&oacute;n se usa para especificar como se van a traducir los instrumentos, de GM
 a los requerimientos de tu teclado . El uso general es :
<BR> (Nombre del instrumento GM )=(N) [AllKeysTo M]
<BR>Donde N es el n&uacute;mero que tu teclado necesita recibir para cambiar al mismo instrumento
 al que cambia el estandar GM .
<BR>Importante: nota que la parte izquierda del signo igual es ignorada, asi que los instrumentos GM se
 suponen que van en orden (de 0 a 127) , y no est&aacute; permitido el cambiar el
 orden de las lineas, ni omitir ninguno de los 128 instrumentos.
<BR>La opci&oacute;n 'AllKeysTo M' se usa para mapear todas las notas que usen ese instrumento
 a la tecla M . Por ejemplo, supongamos que tu teclado midi no tiene un sonido
 de 'Gun Shot' (sonido de disparo de pistola), que es el instrumento 127 seg&uacute;n el estandar GM,
 asi que quieres mapearlo a un tambor de percusi&oacute;n (por ejemplo, la tecla 60),
 que suena similar a un disparo, entonces puedes poner esto en la linea 127 de
 la secci&oacute;n PATCHMAP :
<BR> Gunshot       =100 AllKeysTo 60
<BR>Asi cuando un fichero midi intente tocar una nota con el instrumento 127, 
 ser&aacute; mapeado al instrumento 100 (suponiendo que ese sea el numero usado en tu
 teclado para el "instrumento de percusi&oacute;n") y tocar&aacute; la nota 60 (independientemente
  de la tecla con la que fuera a ser tocado).
<BR>N&oacute;tese que cuando uso la expresi&oacute;n 'instrumento de percusi&oacute;n',
 me refiero al instrumento en el que cada tecla toca un tambor, platillo o caja
 de percusi&oacute;n distinto, y no a un posible sonido que algunos teclados tienen
 y que tocan un tono distinto de la misma bater&iacute;a con cada tecla.
</P>

<P><A NAME="4.3.2."></A><H3>4.3.2. La secci&oacute;n KEYMAP</H3></P>
<P>
La secci&oacute;n KEYMAP se usa para especificar como se van a mapear las teclas, dentro 
de un canal o instrumento dado . El uso es :
</P>
<P>
<BR>DEFINE KEYMAP "Nombre del mapa de teclas"
<BR>C 0 =0
<BR>C#0 =1
<BR>D 0 =2
<BR>...
<BR>END
</P>
<P>
Igual que con la secci&oacute;n PATCHMAP, es muy importante el orden de las lineas
y que est&eacute;n todas las 128 teclas .
<BR>Como puedes definir varios "keymaps" para diferentes canales e instrumentos,
 debes darle un nombre distinto a cada uno en la primera linea.
<BR>Los mapas de teclas (Keymaps) se usan principalmente para mapear las teclas
 en el canal de percusi&oacute;n . Hecha un vistazo a los mapas midi distribuidos
 para ver algunos ejemplos.
</P>

<P><A NAME="4.3.3."></A><H3>4.3.3. La secci&oacute;n CHANNELMAP</H3></P>
<P>           
Esta secci&oacute;n se usa para intercambiar unos canales por otros . Por ejemplo,
 si tu quieres cambiar el primer y el segundo canal, lo puedes hacer muy f&aacute;cilmente
 en esta secci&oacute;n .
<BR>De todas formas, es todav&iacute;a mas &uacute;til, para los teclados que necesitan
 que el canal de percusi&oacute;n est&eacute; en un determinado canal (el estandar GM usa
 el canal 10, otros usan el 16 y otros el 9) .
<BR>N&oacute;tese que los dispositivos midi usan  16 canales, as&iacute; que
 la secci&oacute;n CHANNELMAP tiene 16 lineas (de 0 a 15),como esta :
<BR> (N) = (M) [Keymap "Nombre"] [ForcePatch x]
<BR>Donde N es el canal que va a ser mapeado al canal M .
 Si se usa la opci&oacute;n Keymap, el mapa de teclas con nombre "Nombre" sera usado
 en este canal (la secci&oacute;n Keymap debe haber sido definida ANTES en ese ficher !) .
 Si se usa la opci&oacute;n ForcePatch, todos los eventos que intenten cambiar el instrumento
 que se usa en ese canal ser&aacute;n ignorados, y el instrumento x ser&aacute; usado en su lugar .
<BR>La opci&oacute;n ForcePatch es muy util por ejemplo, para usar
siempre el instrumento de percusi&oacute;n en el canal de percusi&oacute;n .
</P>

<P><A NAME="4.3.4."></A><H3>4.3.4. La secci&oacute;n OPTIONS</H3></P>
<P>
La secci&oacute;n OPTIONS tiene algunas opciones generales que pueden ser muy utiles :
</P>
<P>
OPTIONS
<BR>PitchBenderRatio = r
<BR>MapExpressionToVolumeEvents
<BR>END
</P>
<P>
Puedes especificar ambas opciones, s&oacute;lo una, o ninguna.
<BR>El valor de r en PitchBenderRatio , especifica la proporci&oacute;n por la que ser&aacute;n
 multiplicados los eventos de inflexi&oacute;n del tono (Pitch bender) .
 O sea, cuando un fichero midi intenta mandar un evento de inflexi&oacute;n del tono
 con un valor de n, el valor que realmente ser&aacute; mandado ser&aacute; n*(r/4096) (el
 4096 es para no tener que usar puntos decimales en el fichero map) .
<BR>Esta opci&oacute;n se usa porque el estandar GM dice que cuando un dispositivo midi
 recibe un evento de inflexi&oacute;n del tono con un valor de 4096, debe subir el tono
 a uno mas agudo, pero algunos teclados intentan subir el tono a dos o mas notas
 mas agudas (incluso una octava mas aguda!!) cuando reciben un 4096 .
 Esto se arregla facilmente intentando distintos valores para que en vez de mandar un
 4096, KMid mande el valor apropiado .
<BR>Cuando se especifica la opci&oacute;n MapExpressionToVolumeEvents en el fichero map, y
 un fichero midi intenta mandar un evento de expresi&ocaute;n, KMid mandar&aacute; un evento
 de volumen que comprenden todos los teclados que no son GM, y que tiene un efecto muy parecido .
 Hay muchos ficheros midi que usan eventos de expresi&oacute;n para ir bajando el volumen
 al final de la canci&oacute;n, asi que si tu crees que la m&uacute;sica deber&iacute;a
 ir escuchandose cada vez mas baja, puedes activar esta opci&oacute;n y ver si es lo que necesitas,
 porque posiblemente tu sintetizador midi, est&eacute; ignorando los eventos de
 expresi&oacute;n porque no los comprenda .
</P>

<P><A NAME="4.4."></A><H3>4.4. Usando mapas midi</H3></P>
<P>
Para usar un mapa midi, simplemente abre el di&aacute;logo 'Configurar dispositivos Midi' seleccionando
la entrada 'Configuraci&oacute;n Midi ...' del men&uacute; 'Opciones' .
<BR>Entonces pulsa en 'Buscar ...', selecciona el fichero en el dialogo de abir fichero
 y disfruta de la m&uacute;usica ! :-)
</P>
<HR>
<P ALIGN="RIGHT">
<A HREF="index3.html">Anterior</A>
    <A HREF="index.html">Tabla de Contenidos</A>
    <A HREF="index5.html">Siguiente</A>
</P>
</BODY></HTML>
